# MSc in AI - CE6002 & CS5062

# Etivity 2 - Data preparation & Can we learn?

## Student Name: Mark Murnane
## Student ID: 18195326

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns

## Task 1

### Data Load

_Fill-in the missing values in the bank dataset. Use the EDA techniques from E-tivity 1 to decide how to fill in missing values._ 

In order to fill in missing values we need to identify which attributes have missing values.  In E-tivity 1, only categorical columns had any missing data.  The first step is to load the data from *bank_et2.csv* and confirm that this still holds true.

In [3]:
df = pd.read_csv('bank_et2.csv', header=0, index_col=0)

df.describe(include=np.number)

,age,balance,ratio_bal_ln,ratio_ln_inc,day,duration,campaign,pdays,previous
count,1988.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000
mean,41.753018,1413.663500,0.241951,0.485030,13.851500,292.020500,1.909500,167.896000,2.561500
std,12.724358,3131.224213,0.821604,1.075543,9.712189,221.557295,1.378862,131.754126,3.400735
min,18.000000,-980.000000,-2.632068,-2.851405,1.000000,7.000000,1.000000,-1.000000,0.000000
25%,32.000000,201.500000,-0.308018,-0.274181,5.000000,146.000000,1.000000,75.750000,1.000000
50%,38.000000,551.000000,0.224099,0.487082,12.000000,236.000000,1.000000,182.000000,2.000000
75%,50.000000,1644.500000,0.806315,1.211896,23.000000,379.000000,2.000000,251.000000,3.000000
max,93.000000,81204.000000,2.961979,4.046914,31.000000,1823.000000,11.000000,854.000000,55.000000

In [4]:
df.describe(exclude=np.number)

,job,marital,education,default,housing,loan,contact,month,poutcome,subscribed
count,1990,2000,1896,2000,2000,2000,1809,2000,1546,2000
unique,11,3,3,2,2,2,2,12,3,2
top,management,married,secondary,no,no,no,cellular,feb,failure,yes
freq,461,1111,995,1985,1037,1750,1663,404,955,1000

The `describe()` output confirms the same categorical attributes, and data missing from the _age_ attribute too. The following columns need to be addressed:

 - age
 - job
 - education
 - contact
 - poutcome

#### Notes

Age, job, education and contact are independent variables
poutcome likely is too, but confirm